In [5]:
import pandas as pd
pd.set_option('display.max_rows', 20)

In [7]:
df = pd.DataFrame(['A+', 'A', 'A-', 'B+','B', 'B-', 'C+', 'C', 'C-', 'D+', 'D'],
index=['excellent', 'excellent', 'excellent', 'good', 'good', 'good', 'ok', 'ok', 'ok', 'poor', 'poor'],
columns=['Grades'])

df.head(20)

          Grades
excellent     A+
excellent      A
excellent     A-
good          B+
good           B
good          B-
ok            C+
ok             C
ok            C-
poor          D+
poor           D

In [8]:
df.dtypes

Grades    object
dtype: object

In [10]:
df['Grades'].astype('category').head(20) # Pandas is aware that there are 11 categories

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
good         B-
ok           C+
ok            C
ok           C-
poor         D+
poor          D
Name: Grades, dtype: category
Categories (11, object): ['A', 'A+', 'A-', 'B', ..., 'C+', 'C-', 'D', 'D+']

In [14]:
my_categories = pd.CategoricalDtype(categories=['D', 'D+', 'C-', 'C', 'C+', 'B-', 'B', 'B+', 'A-', 'A', 'A+'],
ordered=True)

grades = df['Grades'].astype(my_categories)
grades.head(20) # Pandas is not only aware that there are 11 categories, but also the order of those categories

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
good         B-
ok           C+
ok            C
ok           C-
poor         D+
poor          D
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

In [15]:
grades[grades>"C"]

excellent    A+
excellent     A
excellent    A-
good         B+
good          B
good         B-
ok           C+
Name: Grades, dtype: category
Categories (11, object): ['D' < 'D+' < 'C-' < 'C' ... 'B+' < 'A-' < 'A' < 'A+']

## get_dummies

In [ ]:
# get_dummies function - convert values of a single col into multiple cols of 0 and 1s indicating the presence of the dummy variable

In [16]:
import numpy as np

In [33]:
df = pd.read_csv('2015census.csv')
df = df[ df['State']=='New York' ]
df.head()

,CensusTract,State,County,TotalPop,Men,Women,Hispanic,White,Black,Native,...,Walk,OtherTransp,WorkAtHome,MeanCommute,Employed,PrivateWork,PublicWork,SelfEmployed,FamilyWork,Unemployment
43195,36001000100,New York,Albany,2001,868,1133,24.3,18.2,51.5,0.0,...,3.7,0.0,1.4,19.7,641,70.2,28.4,1.4,0.0,20.4
43196,36001000200,New York,Albany,4519,2224,2295,11.8,9.0,75.3,0.0,...,11.9,0.0,1.9,22.9,1866,73.6,22.6,3.9,0.0,7.9
43197,36001000300,New York,Albany,5244,2643,2601,6.6,45.7,37.5,0.3,...,3.3,0.8,1.9,18.6,2125,73.4,23.0,3.6,0.0,9.7
43198,36001000401,New York,Albany,2423,927,1496,4.4,86.8,4.2,1.9,...,0.0,0.5,0.7,18.8,885,60.0,33.7,6.3,0.0,7.9
43199,36001000403,New York,Albany,4654,2100,2554,8.4,66.2,15.3,0.8,...,1.2,3.0,0.4,19.4,2678,67.2,27.4,5.3,0.0,7.4

In [34]:
df = df.set_index('County').groupby(level=0)['TotalPop'].agg(np.average)
df.head(25)

County
Albany         4099.506667
Allegany       3697.692308
Bronx          4213.442478
Broome         3601.690909
Cattaraugus    3760.095238
                  ...
Hamilton       1190.000000
Herkimer       3370.210526
Jefferson      4574.884615
Kings          3410.327201
Lewis          3874.857143
Name: TotalPop, Length: 25, dtype: float64

In [35]:
pd.cut(df,10)

County
Albany         (3870.806, 4317.607]
Allegany       (3424.005, 3870.806]
Bronx          (3870.806, 4317.607]
Broome         (3424.005, 3870.806]
Cattaraugus    (3424.005, 3870.806]
                       ...
Washington     (3424.005, 3870.806]
Wayne          (3870.806, 4317.607]
Westchester    (4317.607, 4764.408]
Wyoming        (3424.005, 3870.806]
Yates          (4764.408, 5211.209]
Name: TotalPop, Length: 62, dtype: category
Categories (10, interval[float64]): [(1185.532, 1636.801] < (1636.801, 2083.602] < (2083.602, 2530.403] < (2530.403, 2977.204] ... (3870.806, 4317.607] < (4317.607, 4764.408] < (4764.408, 5211.209] < (5211.209, 5658.01]]

In [36]:
import pandas as pd
import numpy as np

In [75]:
df = pd.read_csv('World_University_Rank_2020.csv')
df.head()

,Rank_Char,Score_Rank,University,Country,Number_students,Numb_students_per_Staff,International_Students,Percentage_Female,Percentage_Male,Teaching,Research,Citations,Industry_Income,International_Outlook,Score_Result,Overall_Ranking
0,1,1,University of Oxford,United Kingdom,"20,664",11.2,41%,46%,54%,90.5,99.6,98.4,65.5,96.4,95.4,95.40
1,2,2,California Institute of Technology,United States,"2,240",6.4,30%,34%,66%,92.1,97.2,97.9,88.0,82.5,94.5,94.50
2,3,3,University of Cambridge,United Kingdom,"18,978",10.9,37%,47%,53%,91.4,98.7,95.8,59.3,95.0,94.4,94.40
3,4,4,Stanford University,United States,"16,135",7.3,23%,43%,57%,92.8,96.4,99.9,66.2,79.5,94.3,94.30
4,5,5,Massachusetts Institute of Technology,United States,"11,247",8.6,34%,39%,61%,90.5,92.4,99.5,86.9,89.0,93.6,93.60

In [46]:
df['Rank_Char'].dtype

dtype('O')

In [78]:
# classify first tier 1-100, second tier 101-200, third tier 201-300, after 301 others 
def create_category(ranking):
    # 'Rank_Char' is just an integer
    if (ranking >= 1) & (ranking <= 100):
        return "First Tier Top University"
    elif (ranking >= 101) & (ranking <= 200):
        return "Second Tier Top University"
    elif (ranking >= 201) & (ranking <= 300):
        return "Third Tier Top University"
    return "Other Top University"

df['Rank_Level'] = df['Score_Rank'].apply(lambda x: create_category(x))

In [79]:
df.pivot_table(values='Score_Rank', index='Country', columns='Rank_Level', aggfunc=[np.mean]).head(10)

                                       mean                       \
Rank_Level        First Tier Top University Other Top University
Country
Algeria                                 NaN           465.875000
Argentina                               NaN           468.750000
Australia                             61.75           329.500000
Austria                                 NaN           334.000000
Bangladesh                              NaN           483.000000
Belarus                                 NaN           459.000000
Belgium                               66.50                  NaN
Brazil                                  NaN           457.909091
Brunei Darussalam                       NaN                  NaN
Bulgaria                                NaN           471.000000


Rank_Level        Second Tier Top University Third Tier Top University
Country
Algeria                                  NaN                       NaN
Argentina                                NaN                       NaN
Australia                         157.461538                     238.9
Austria                           154.200000                     259.0
Bangladesh                               NaN                       NaN
Belarus                                  NaN                       NaN
Belgium                           137.000000                     213.0
Brazil                            172.000000                     270.0
Brunei Darussalam                        NaN                     234.0
Bulgaria                                 NaN                       NaN

In [80]:
df.pivot_table(values='Score_Rank', index='Country', columns='Rank_Level', aggfunc=[np.mean, np.max], margins=True).head(10)

                                       mean                       \
Rank_Level        First Tier Top University Other Top University
Country
Algeria                                 NaN           465.875000
Argentina                               NaN           468.750000
Australia                             61.75           329.500000
Austria                                 NaN           334.000000
Bangladesh                              NaN           483.000000
Belarus                                 NaN           459.000000
Belgium                               66.50                  NaN
Brazil                                  NaN           457.909091
Brunei Darussalam                       NaN                  NaN
Bulgaria                                NaN           471.000000

                                                                        \
Rank_Level        Second Tier Top University Third Tier Top University
Country
Algeria                                  NaN                       NaN
Argentina                                NaN                       NaN
Australia                         157.461538                     238.9
Austria                           154.200000                     259.0
Bangladesh                               NaN                       NaN
Belarus                                  NaN                       NaN
Belgium                           137.000000                     213.0
Brazil                            172.000000                     270.0
Brunei Darussalam                        NaN                     234.0
Bulgaria                                 NaN                       NaN

                                                   amax                       \
Rank_Level                All First Tier Top University Other Top University
Country
Algeria            465.875000                       NaN                521.0
Argentina          468.750000                       NaN                523.0
Australia          178.514286                      99.0                357.0
Austria            225.000000                       NaN                360.0
Bangladesh         483.000000                       NaN                483.0
Belarus            459.000000                       NaN                459.0
Belgium            138.375000                      94.0                  NaN
Brazil             447.608696                       NaN                534.0
Brunei Darussalam  234.000000                       NaN                  NaN
Bulgaria           471.000000                       NaN                471.0


Rank_Level        Second Tier Top University Third Tier Top University  All
Country
Algeria                                  NaN                       NaN  521
Argentina                                NaN                       NaN  523
Australia                              195.0                     296.0  357
Austria                                198.0                     297.0  360
Bangladesh                               NaN                       NaN  483
Belarus                                  NaN                       NaN  459
Belgium                                155.0                     224.0  224
Brazil                                 172.0                     270.0  534
Brunei Darussalam                        NaN                     234.0  234
Bulgaria                                 NaN                       NaN  471

In [81]:
new_df = df.pivot_table(values='Score_Rank', index='Country', columns='Rank_Level', aggfunc=[np.mean, np.max], margins=True)
new_df.index

Index(['Algeria', 'Argentina', 'Australia', 'Austria', 'Bangladesh', 'Belarus',
       'Belgium', 'Brazil', 'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile',
       'China', 'Colombia', 'Costa Rica', 'Croatia', 'Cuba', 'Cyprus',
       'Czech Republic', 'Denmark', 'Egypt', 'Estonia', 'Finland', 'France',
       'Georgia', 'Germany', 'Ghana', 'Greece', 'Hong Kong', 'Hungary',
       'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel',
       'Italy', 'Jamaica', 'Japan', 'Jordan', 'Kazakhstan', 'Kenya', 'Kuwait',
       'Latvia', 'Lebanon', 'Lithuania', 'Luxembourg', 'Macao', 'Malaysia',
       'Malta', 'Mexico', 'Montenegro', 'Morocco', 'Nepal', 'Netherlands',
       'New Zealand', 'Nigeria', 'Northern Cyprus', 'Norway', 'Oman',
       'Pakistan', 'Peru', 'Philippines', 'Poland', 'Portugal', 'Puerto Rico',
       'Qatar', 'Romania', 'Russian Federation', 'Saudi Arabia', 'Singapore',
       'Slovakia', 'Slovenia', 'South Africa', 'South Korea', 'Spain',
       'Sri Lanka', 'Sweden', 'Switzerland', 'Taiwan', 'Tanzania', 'Thailand',
       'Tunisia', 'Turkey', 'Uganda', 'Ukraine', 'United Arab Emirates',
       'United Kingdom', 'United States', 'Venezuela', 'Vietnam', 'All'],
      dtype='object', name='Country')

In [82]:
new_df.columns

MultiIndex([('mean',  'First Tier Top University'),
            ('mean',       'Other Top University'),
            ('mean', 'Second Tier Top University'),
            ('mean',  'Third Tier Top University'),
            ('mean',                        'All'),
            ('amax',  'First Tier Top University'),
            ('amax',       'Other Top University'),
            ('amax', 'Second Tier Top University'),
            ('amax',  'Third Tier Top University'),
            ('amax',                        'All')],
           names=[None, 'Rank_Level'])

In [83]:
new_df['mean']['First Tier Top University'].head(15)

Country
Algeria                NaN
Argentina              NaN
Australia            61.75
Austria                NaN
Bangladesh             NaN
Belarus                NaN
Belgium              66.50
Brazil                 NaN
Brunei Darussalam      NaN
Bulgaria               NaN
Canada               42.80
Chile                  NaN
China                56.20
Colombia               NaN
Costa Rica             NaN
Name: First Tier Top University, dtype: float64

In [84]:
type(new_df['mean']['First Tier Top University'])

pandas.core.series.Series

### idxmax() - (built in function to the Series obejct) find country with max average score on First Tier Top Uni

In [85]:
new_df['mean']['First Tier Top University'].idxmax()

'Norway'

In [86]:
new_df.head()

                                mean                       \
Rank_Level First Tier Top University Other Top University
Country
Algeria                          NaN              465.875
Argentina                        NaN              468.750
Australia                      61.75              329.500
Austria                          NaN              334.000
Bangladesh                       NaN              483.000

                                                                             \
Rank_Level Second Tier Top University Third Tier Top University         All
Country
Algeria                           NaN                       NaN  465.875000
Argentina                         NaN                       NaN  468.750000
Australia                  157.461538                     238.9  178.514286
Austria                    154.200000                     259.0  225.000000
Bangladesh                        NaN                       NaN  483.000000

                                amax                       \
Rank_Level First Tier Top University Other Top University
Country
Algeria                          NaN                521.0
Argentina                        NaN                523.0
Australia                       99.0                357.0
Austria                          NaN                360.0
Bangladesh                       NaN                483.0


Rank_Level Second Tier Top University Third Tier Top University  All
Country
Algeria                           NaN                       NaN  521
Argentina                         NaN                       NaN  523
Australia                       195.0                     296.0  357
Austria                         198.0                     297.0  360
Bangladesh                        NaN                       NaN  483

### stack() - move the lowermost column (tiers of Uni) to innermost row

In [87]:
new_df = new_df.stack()
new_df.head(15)

                                             mean   amax
Country    Rank_Level
Algeria    Other Top University        465.875000  521.0
           All                         465.875000  521.0
Argentina  Other Top University        468.750000  523.0
           All                         468.750000  523.0
Australia  First Tier Top University    61.750000   99.0
           Other Top University        329.500000  357.0
           Second Tier Top University  157.461538  195.0
           Third Tier Top University   238.900000  296.0
           All                         178.514286  357.0
Austria    Other Top University        334.000000  360.0
           Second Tier Top University  154.200000  198.0
           Third Tier Top University   259.000000  297.0
           All                         225.000000  360.0
Bangladesh Other Top University        483.000000  483.0
           All                         483.000000  483.0

In [88]:
new_df.unstack().head(15)

                                       mean                       \
Rank_Level        First Tier Top University Other Top University
Country
Algeria                                 NaN           465.875000
All                               54.413534           419.708908
Argentina                               NaN           468.750000
Australia                         61.750000           329.500000
Austria                                 NaN           334.000000
Bangladesh                              NaN           483.000000
Belarus                                 NaN           459.000000
Belgium                           66.500000                  NaN
Brazil                                  NaN           457.909091
Brunei Darussalam                       NaN                  NaN
Bulgaria                                NaN           471.000000
Canada                            42.800000           348.000000
Chile                                   NaN           450.428571
China                             56.200000           389.537037
Colombia                                NaN           449.142857

                                                                        \
Rank_Level        Second Tier Top University Third Tier Top University
Country
Algeria                                  NaN                       NaN
All                               150.620513                254.793358
Argentina                                NaN                       NaN
Australia                         157.461538                238.900000
Austria                           154.200000                259.000000
Bangladesh                               NaN                       NaN
Belarus                                  NaN                       NaN
Belgium                           137.000000                213.000000
Brazil                            172.000000                270.000000
Brunei Darussalam                        NaN                234.000000
Bulgaria                                 NaN                       NaN
Canada                            147.444444                261.571429
Chile                                    NaN                272.250000
China                             160.200000                264.705882
Colombia                                 NaN                246.000000

                                                   amax                       \
Rank_Level                All First Tier Top University Other Top University
Country
Algeria            465.875000                       NaN                521.0
All                315.304441                     100.0                535.0
Argentina          468.750000                       NaN                523.0
Australia          178.514286                      99.0                357.0
Austria            225.000000                       NaN                360.0
Bangladesh         483.000000                       NaN                483.0
Belarus            459.000000                       NaN                459.0
Belgium            138.375000                      94.0                  NaN
Brazil             447.608696                       NaN                534.0
Brunei Darussalam  234.000000                       NaN                  NaN
Bulgaria           471.000000                       NaN                471.0
Canada             216.800000                      69.0                441.0
Chile              410.833333                       NaN                513.0
China              328.604938                      85.0                506.0
Colombia           423.750000                       NaN                508.0


Rank_Level        Second Tier Top University Third Tier Top University    All
Country
Algeria                                  NaN                       NaN  521.0
All                                    200.0                     300.0  535.0
Argentina                                NaN                       NaN  523.0
Australia                              195.0                     296.0  357.0
Austria                                198.0                     297.0  360.0
Bangladesh                               NaN                       NaN  483.0
Belarus                                  NaN                       NaN  459.0
Belgium                                155.0                     224.0  224.0
Brazil                                 172.0                     270.0  534.0
Brunei Darussalam                        NaN                     234.0  234.0
Bulgaria                                 NaN                       NaN  471.0
Canada                                 174.0                     291.0  441.0
Chile                                    NaN                     299.0  513.0
China                                  197.0                     300.0  506.0
Colombia                                 NaN                     246.0  508.0

In [89]:
new_df.unstack().unstack().head(15) # unstacked all the way to a single column = a series object is returned. this col is just a 'value'

      Rank_Level                 Country
mean  First Tier Top University  Algeria                    NaN
                                 All                  54.413534
                                 Argentina                  NaN
                                 Australia            61.750000
                                 Austria                    NaN
                                 Bangladesh                 NaN
                                 Belarus                    NaN
                                 Belgium              66.500000
                                 Brazil                     NaN
                                 Brunei Darussalam          NaN
                                 Bulgaria                   NaN
                                 Canada               42.800000
                                 Chile                      NaN
                                 China                56.200000
                                 Colombia                   NaN
dtype: float64